/*
	홀수 짝수 판별기
		2로 나눴을 때 나머지가 0이면 짝수, 1이면 홀수이다.
		0은 나머지가 0으로 나와서 짝수로 판별되지만, 살짝 애매하다!!
		0을 입력했을 땐 추가로 "0은 애매해요~!" 문구 출력!

	[출력결과]
	정수를 입력해주세요 : 0
	입력하신 0은(는) 짝수입니다.
	0은 애매해요~!

	정수를 입력해주세요 : 1
	입력하신 1은(는) 홀수입니다.
*/

#include <stdio.h>

void main()
{
	// 변수 1개 생성
	int iNum = 0;

	// 출력 문구 만들기
	printf("정수를 입력해주세요 : ");
	
	// 입력받기
	scanf("%d", &iNum);

	// 조건문
	if (iNum % 2 == 0) // 짝수
	{
		printf("입력하신 %d은(는) 짝수입니다.\n", iNum);

		if (iNum == 0)
		{
			printf("0은 애매해요~!\n");
		}
	}
	else // iScore % 2 == 1 // 홀수
	{
		printf("입력하신 %d은(는) 홀수입니다.\n", iNum);
	}
}